Revit 2024 API
CurtainGridSet Class
A set that can contain any type of object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class CurtainGridSet : APIObject,
	IEnumerable
Visual Basic
Public Class CurtainGridSet _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class CurtainGridSet : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CurtainGridSet
See Also
CurtainGridSet Members
Autodesk.Revit.DB Namespace